IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0g1x0x_g3x0x/OPA1_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="OPA1" HW_revision="1.0">
    <group id="OPA1_GPRCM" name="OPA1_GPRCM" instances="1" offset="0x800" instaddr="0x100" description="">
        <register id="OPA1_PWREN" width="32" offset="0x0" description="Power enable">
            <bitfield id="ENABLE" description="Enable the power" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable Power"/>
                <bitenum id="ENABLE" value="0x1" description="Enable Power"/>
            </bitfield>
        </register>
        <register id="OPA1_RSTCTL" width="32" offset="0x4" description="Reset Control">
            <bitfield id="RESETSTKYCLR" description="Clear the RESETSTKY bit in the STAT register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear reset sticky bit"/>
            </bitfield>
            <bitfield id="RESETASSERT" description="Assert reset to the peripheral" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="ASSERT" value="0x1" description="Assert reset"/>
            </bitfield>
        </register>
        <register id="OPA1_GPRCM_STAT" width="32" offset="0x14" description="Status Register">
            <bitfield id="RESETSTKY" description="This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register" begin="16" end="16" width="1" rwaccess="R">
                <bitenum id="NORES" value="0x0" description="The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register"/>
                <bitenum id="RESET" value="0x1" description="The peripheral was reset since the last bit clear"/>
            </bitfield>
        </register>
    </group>
    <register id="OPA1_CLKOVR" width="32" offset="0x1010" description="Clock Override">
        <bitfield id="OVERRIDE" description="Unlocks the functionality of [RUN_STOP] to override the automatic peripheral clock request" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLED" value="0x0" description="Override disabled"/>
            <bitenum id="ENABLED" value="0x1" description="Override enabled"/>
        </bitfield>
        <bitfield id="RUN_STOP" description="If [OVERRIDE] is enabled, this register is used to manually control the peripheral's clock request to the system" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="RUN" value="0x0" description="Run/ungate functional clock"/>
            <bitenum id="STOP" value="0x1" description="Stop/gate functional clock"/>
        </bitfield>
    </register>
    <register id="OPA1_PWRCTL" width="32" offset="0x101C" description="Power Control">
        <bitfield id="AUTO_OFF" description="When set the peripheral will remove its local IP request for enable so that it can be disabled if no other entities in the system are requesting it to be enabled." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable automatic power off function"/>
            <bitenum id="ENABLE" value="0x1" description="Enable automatic power off function"/>
        </bitfield>
    </register>
    <register id="OPA1_CTL" width="32" offset="0x1100" description="Control Register">
        <bitfield id="ENABLE" description="OAxn Enable." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="OAxn OFF"/>
            <bitenum id="ON" value="0x1" description="OAxn ON"/>
        </bitfield>
    </register>
    <register id="OPA1_CFGBASE" width="32" offset="0x1104" description="Configuration Base Register">
        <bitfield id="GBW" description="Select gain bandwidth which affects current as well the gain bandwidth. The lower gain bandwidth has lower current. See device specific datasheet for values. Can only be modified when STAT.BUSY=0." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="LOWGAIN" value="0x0" description="Low gain bandwidth. See device specific datasheet for gain bandwidth."/>
            <bitenum id="HIGHGAIN" value="0x1" description="High gain bandwidth. See device specific datasheet for gain bandwidth."/>
        </bitfield>
        <bitfield id="RRI" description="Rail-to-rail input enable. Can only be modified when STAT.BUSY=0" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="Rail-to-rail input disable."/>
            <bitenum id="ON" value="0x1" description="Rail-to-rail input enable."/>
        </bitfield>
    </register>
    <register id="OPA1_CFG" width="32" offset="0x1108" description="Configuration Register">
        <bitfield id="CHOP" description="Chopping enable." begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="Chopping disable."/>
            <bitenum id="ON" value="0x1" description="Standard chopping enable."/>
            <bitenum id="AVGON" value="0x2" description="Chop with post average on. Requires output to be connect to ADC in average mode."/>
        </bitfield>
        <bitfield id="OUTPIN" description="Enable output pin" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLED" value="0x0" description="Output pin disabled"/>
            <bitenum id="ENABLED" value="0x1" description="Output pin enabled"/>
        </bitfield>
        <bitfield id="PSEL" description="Positive OA input selection.  
Please refer to the device specific datasheet for exact channels available." begin="6" end="3" width="4" rwaccess="R/W">
            <bitenum id="NC" value="0x0" description="No connect"/>
            <bitenum id="EXTPIN0" value="0x1" description="external pin OA+0"/>
            <bitenum id="EXTPIN1" value="0x2" description="external pin OAn+1"/>
            <bitenum id="DAC12OUT" value="0x3" description="DAC12OUT"/>
            <bitenum id="DAC8OUT" value="0x4" description="DAC8OUT"/>
            <bitenum id="VREF" value="0x5" description="VREF Channel"/>
            <bitenum id="OANM1RTOP" value="0x6" description="OA[n-1]Rtop"/>
            <bitenum id="GPAMP_OUT_INT" value="0x7" description="GPAMP_OUT_INT Input"/>
            <bitenum id="VSS" value="0x8" description="Internal Grouund Connection"/>
        </bitfield>
        <bitfield id="NSEL" description="Negative OA input selection.
Please refer to the device specific datasheet for exact channels available." begin="9" end="7" width="3" rwaccess="R/W">
            <bitenum id="NC" value="0x0" description="no connect"/>
            <bitenum id="EXTPIN0" value="0x1" description="external pin OAn-0"/>
            <bitenum id="EXTPIN1" value="0x2" description="external pin OAn-1"/>
            <bitenum id="OANP1RBOT" value="0x3" description="OA[n+1]Rbot"/>
            <bitenum id="OANRTAP" value="0x4" description="OA[n]Rtap"/>
            <bitenum id="OANRTOP" value="0x5" description="OA[n]Rtop"/>
            <bitenum id="SPARE" value="0x6" description="Spare input"/>
        </bitfield>
        <bitfield id="MSEL" description="MSEL Mux selection. 
Please refer to the device specific datasheet for exact channels available." begin="12" end="10" width="3" rwaccess="R/W">
            <bitenum id="NC" value="0x0" description="no connect"/>
            <bitenum id="EXTNPIN1" value="0x1" description="external pin OAn-1"/>
            <bitenum id="VSS" value="0x2" description="VSS"/>
            <bitenum id="DAC12OUT" value="0x3" description="DAC12 Output"/>
            <bitenum id="OANM1RTOP" value="0x4" description="OA[n-1]Rtop"/>
        </bitfield>
        <bitfield id="GAIN" description="Gain setting. Refer to TRM for enumeration information." begin="15" end="13" width="3" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minmum gain value"/>
            <bitenum id="MAXIMUM" value="0x7" description="Maximum gain value."/>
        </bitfield>
    </register>
    <register id="OPA1_STAT" width="32" offset="0x1118" description="Status Register">
        <bitfield id="RDY" description="OA ready status." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="OAxn is not ready."/>
            <bitenum id="TRUE" value="0x1" description="OAxn is ready."/>
        </bitfield>
    </register>
</module>
